app/controllers/account_controller.rb

  def set_autologin_cookie(user)
    token = Token.create(:user => user, :action => 'autologin')
    cookie_options = {
      :value => token.value,
      :expires => 1.year.from_now,
      :path => Redmine::Configuration['autologin_cookie_path'],
      :secure => Redmine::Configuration['autologin_cookie_secure'],
      :httponly => true
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) AND (users.status = 1) AND ( (`users`.`type` = 'User' OR `users`.`type` = 'AnonymousUser' ) )