app/controllers/admin_controller.rb

  def projects
    if User.current.admin
      @status = params[:status] ? params[:status].to_i : 1
      c = ARCondition.new(@status == 0 ? "status <> 0" : ["status = ?", @status])

      unless params[:name].blank?
        name = "%#{params[:name].strip.downcase}%"
        c << ["LOWER(identifier) LIKE ? OR LOWER(name) LIKE ?", name, name]
      end

      @projects = Project.find :all, :order => 'lft',
                                     :conditions => c.conditions
---
SELECT * FROM `projects` WHERE (1=1 AND (status = 1)) ORDER BY lft