app/controllers/projects_controller.rb

SELECT * FROM `projects` WHERE (projects.status=1 AND projects.is_public = 1) ORDER BY lft
---
  def index
    respond_to do |format|
      format.html {
        @projects = Project.visible.find(:all, :order => 'lft')

SELECT * FROM `custom_fields` WHERE ( (`custom_fields`.`type` = 'IssueCustomField' ) ) ORDER BY custom_fields.position
SELECT * FROM `trackers` ORDER BY position
---
  def new
    @issue_custom_fields = IssueCustomField.find(:all, :order => "#{CustomField.table_name}.position")
    @trackers = Tracker.all

SELECT * FROM `custom_fields` WHERE ( (`custom_fields`.`type` = 'IssueCustomField' ) ) ORDER BY custom_fields.position
SELECT * FROM `trackers` ORDER BY position
INSERT INTO `projects` (`name`, `description`, `homepage`, `is_public`, `parent_id`, `created_on`, `updated_on`, `identifier`, `status`, `lft`, `rgt`) VALUES('test', 'etest project for test', '', 1, NULL, '2013-11-07 08:05:29', '2013-11-07 08:05:29', 'test', 1, 1, 2)
---
  def create
    @issue_custom_fields = IssueCustomField.find(:all, :order => "#{CustomField.table_name}.position")
    @trackers = Tracker.all
    @project = Project.new
    @project.safe_attributes = params[:project]

    saved = @project.save

SELECT * FROM `users` WHERE (`users`.`id` = 1) AND (users.status = 1) AND ( (`users`.`type` = 'User' OR `users`.`type` = 'AnonymousUser' ) )
SELECT * FROM `news` WHERE (`news`.project_id = 1) ORDER BY news.created_on DESC LIMIT 5
SELECT `projects`.* FROM `projects` INNER JOIN `members` ON `projects`.id = `members`.project_id WHERE ((`members`.user_id = 1) AND ((projects.status=1)))
SELECT DISTINCT trackers.* FROM `trackers` INNER JOIN `projects_trackers` ON `projects_trackers`.tracker_id = `trackers`.id INNER JOIN `projects` ON `projects`.id = `projects_trackers`.project_id WHERE (projects.lft >= 1 AND projects.rgt <= 2 AND projects.status = 1) ORDER BY trackers.position
SELECT count(DISTINCT `issues`.id) AS count_all, tracker_id AS tracker_id FROM `issues` LEFT OUTER JOIN `projects` ON `projects`.id = `issues`.project_id LEFT OUTER JOIN `issue_statuses` ON `issue_statuses`.id = `issues`.status_id LEFT OUTER JOIN `trackers` ON `trackers`.id = `issues`.tracker_id WHERE (((projects.id = 1 OR (projects.lft > 1 AND projects.rgt < 2))) AND issue_statuses.is_closed=0) AND (projects.status=1 AND projects.id IN (SELECT em.project_id FROM enabled_modules em WHERE em.name='issue_tracking')) GROUP BY tracker_id
SELECT sum(`time_entries`.hours) AS sum_hours FROM `time_entries` LEFT OUTER JOIN `projects` ON `projects`.id = `time_entries`.project_id WHERE ((projects.id = 1 OR (projects.lft > 1 AND projects.rgt < 2))) AND (projects.status=1 AND projects.id IN (SELECT em.project_id FROM enabled_modules em WHERE em.name='time_tracking'))
---
  def show
    @users_by_role = @project.users_by_role
    @subprojects = @project.children.visible.all
    @news = @project.news.find(:all, :limit => 5, :include => [ :author, :project ], :order => "#{News.table_name}.created_on DESC")
    @trackers = @project.rolled_up_trackers

    cond = @project.project_condition(Setting.display_subprojects_issues?)

    @open_issues_by_tracker = Issue.visible.count(:group => :tracker,
                                            :include => [:project, :status, :tracker],
                                            :conditions => ["(#{cond}) AND #{IssueStatus.table_name}.is_closed=?", false])
    @total_issues_by_tracker = Issue.visible.count(:group => :tracker,
                                            :include => [:project, :status, :tracker],
                                            :conditions => cond)

    if User.current.allowed_to?(:view_time_entries, @project)
      @total_hours = TimeEntry.visible.sum(:hours, :include => :project, :conditions => cond).to_f

UPDATE `projects` SET `description` = 'h3. tests中文输入法\r\nh3. He', `updated_on` = '2013-11-17 03:08:53' WHERE `id` = 1
---
  def update
    @project.safe_attributes = params[:project]
    updated = @project.save

SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
---
  def find_optional_project
    return true unless params[:id]
    @project = Project.find(params[:id])

SELECT * FROM `custom_fields` WHERE ( (`custom_fields`.`type` = 'IssueCustomField' ) ) ORDER BY custom_fields.position
SELECT * FROM `trackers` ORDER BY position
---
  def load_project_settings
    @issue_custom_fields = IssueCustomField.find(:all, :order => "#{CustomField.table_name}.position")
    @issue_category ||= IssueCategory.new
    @member ||= @project.members.new
    @trackers = Tracker.all