app/controllers/welcome_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1) AND (users.status = 1) AND ( (`users`.`type` = 'User' OR `users`.`type` = 'AnonymousUser' ) )
---
  def index
  	::I18n.locale=:zh
    @news = News.latest User.current